studentd = {1:['Уваров Лев Ильяович', 18 ,'ПМИ-81'], 2: ['Третьяков Аверкий Тарасович', 19 , 'ПМ-82'],
            3:['Мишин Лев Николаевич', 17 ,'ПМИ-81'], 4:['Орлов Корнелий Александрович', 22, 'ПМИ-83'],
            5:['Орехов Владислав Ростиславович', 21, 'ПМ-81'], 6:['Максимов Кирилл Рудольфович', 20, 'ПМИ-83'],
            7:['Воробьёв Гордей Куприянович',20,'ПМ-82'], 8:['Петров Борис Демьянович', 19, 'ВИ-21'],
            9:['Мишин Оскар Семёнович', 25,'ВИ-22'], 10:['Филатов Максимилиан Степанович', 18,'ВИ-23'],
            11:['Баранова Алиса Станиславовна',19,'ВИ-33'], 12:['Ларионова Анфиса Вениаминовна', 23,'ВИ-33'],
            13:['Кошелева Вида Романовна', 24,'ВИ-31']
            }
print(f'Всего студентов {len(studentd)}')
# Задание 1
# fio = input('Введите фамилию студента: ')
# age = int(input('Введите возраст студента: '))
# grup = input('Введите группу студента: ')
#
# l = len(studentd)+1
# list = [fio, age, grup]
#
# studentd[l] = list
# print(studentd[l])
# print(f'Всего студентов {len(studentd)}')

'////////////////////////////////////////////////////////////'

# Задание 2
# nomer = int(input('Введите номер студента которого желаете заменить: '))
# fio = input('Введите новую фамилию студента: ')
# age = int(input('Введите возраст нового студента: '))
# grup = input('Введите группу нового студента: ')
#
# studentd[nomer][0] = fio
# studentd[nomer][1] = age
# studentd[nomer][2] = grup
#
# print(studentd)

'////////////////////////////////////////////////////////////'

# Задание 3
# numer = int(input('Введите номер студента которого желаете удалить: '))
#
# del studentd[numer]
# print(studentd)
# print(f'Всего студентов {len(studentd)}')

'////////////////////////////////////////////////////////////'

# Задание 4
while True:
    number = (input('Введите номер студента: '))
    print(studentd[int(number)])